УТ_для_edt/src/InformationRegisters/смартСтопЛистТехническойОтсрочки/смартСтопЛистТехническойОтсрочки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартСтопЛистТехническойОтсрочки</name>
  <comment>#4792 смарт: Тимофеева 17.03.26 / Контроль дебиторской задолженности. Реализация блокировки клиента. Техническая отсрочка. Этап 1</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ПродажаОтгрузкаЗапрещена</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>СуммаЗадолженности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетныйДокумент</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/смартСтопЛистТехническойОтсрочки/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

///////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗапретитьТехническуюОтсрочку(СтруктураЗаписи) Экспорт 
	МенеджерЗаписи = Регистрысведений.смартСтопЛистТехническойОтсрочки.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДатаСеанса();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтруктураЗаписи); 
	МенеджерЗаписи.ПродажаОтгрузкаЗапрещена = Истина;
	МенеджерЗаписи.Записать();
КонецПроцедуры

Процедура РазрешитьТехническуюОтсрочку(СтруктураЗаписи) Экспорт 
	МенеджерЗаписи = Регистрысведений.смартСтопЛистТехническойОтсрочки.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДатаСеанса();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтруктураЗаписи); 
	МенеджерЗаписи.ПродажаОтгрузкаЗапрещена = Ложь;	
	МенеджерЗаписи.Записать();
КонецПроцедуры

Функция КлиентуЗапрещенаТехническаяОтсрочка(Партнер) Экспорт
	Результат = Ложь;
	
	СегментИсключенийДляТехническойОтсрочки = Справочники.смартПредопределенныеЗначения.СегментИсключенийДляТехническойОтсрочки.Значение;																			
	Если ЗначениеЗаполнено(СегментИсключенийДляТехническойОтсрочки) 
		И ТипЗнч(СегментИсключенийДляТехническойОтсрочки) = Тип("СправочникСсылка.СегментыПартнеров")
		И СегментыСервер.ВходитВСегмент(Партнер, СегментИсключенийДляТехническойОтсрочки,,Ложь) Тогда
		Возврат Результат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(МАКСИМУМ(смартСтопЛистТехническойОтсрочкиСрезПоследних.ПродажаОтгрузкаЗапрещена), Ложь) КАК ПродажаОтгрузкаЗапрещена
	|ИЗ
	|	РегистрСведений.смартСтопЛистТехническойОтсрочки.СрезПоследних(, Партнер = &Партнер) КАК смартСтопЛистТехническойОтсрочкиСрезПоследних";
	Запрос.УстановитьПараметр("Партнер", Партнер);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Результат = ВыборкаДетальныеЗаписи.ПродажаОтгрузкаЗапрещена;
	КонецЕсли;
    Возврат Результат;
КонецФункции  

Функция СостояниеПоТехническойОтсрочке(Партнер, ДатаСостояния = Неопределено, СНегативнойИсторией = Ложь) Экспорт
	Результат = Новый Структура("Партнер, ПродажаОтгрузкаЗапрещена, ДатаЗапрета, ИмеетНегативнуюИсторию", Партнер, Ложь, Дата(1,1,1,0,0,0), Ложь);
	
	Если НЕ смартКонтрольДебиторскойЗадолженности.ВедетсяКонтрольДебиторскойЗадолженности(ДатаСостояния) Тогда
		Возврат Результат;
	КонецЕсли;

	СегментИсключенийДляТехническойОтсрочки = Справочники.смартПредопределенныеЗначения.СегментИсключенийДляТехническойОтсрочки.Значение;																			
	Если ЗначениеЗаполнено(СегментИсключенийДляТехническойОтсрочки) 
		И ТипЗнч(СегментИсключенийДляТехническойОтсрочки) = Тип("СправочникСсылка.СегментыПартнеров")
		И СегментыСервер.ВходитВСегмент(Партнер, СегментИсключенийДляТехническойОтсрочки,,Ложь) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Если СНегативнойИсторией Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	смартСтопЛистТехническойОтсрочки.Партнер КАК Партнер,
		|	ИСТИНА КАК ИмеетНегативнуюИсторию
		|ПОМЕСТИТЬ ВТ_ПартнерыСНегативнойИсторией
		|ИЗ
		|	РегистрСведений.смартСтопЛистТехническойОтсрочки КАК смартСтопЛистТехническойОтсрочки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.смартСтопЛистТехническойОтсрочки КАК смартСтопЛистТехническойОтсрочки1
		|		ПО смартСтопЛистТехническойОтсрочки.Партнер = смартСтопЛистТехническойОтсрочки1.Партнер
		|			И смартСтопЛистТехническойОтсрочки.Контрагент = смартСтопЛистТехническойОтсрочки1.Контрагент
		|			И смартСтопЛистТехническойОтсрочки.ЗаказКлиента = смартСтопЛистТехническойОтсрочки1.ЗаказКлиента
		|			И (НЕ смартСтопЛистТехническойОтсрочки1.ПродажаОтгрузкаЗапрещена)
		|ГДЕ
		|	смартСтопЛистТехническойОтсрочки.Партнер = &Партнер
		|	И смартСтопЛистТехническойОтсрочки.ПродажаОтгрузкаЗапрещена
		|	И ВЫБОР
		|			КОГДА смартСтопЛистТехническойОтсрочки1.Период ЕСТЬ NULL
		|				ТОГДА РАЗНОСТЬДАТ(смартСтопЛистТехническойОтсрочки.Период, &ТекущаяДата, ДЕНЬ)
		|			ИНАЧЕ РАЗНОСТЬДАТ(смартСтопЛистТехническойОтсрочки.Период, смартСтопЛистТехническойОтсрочки1.Период, ДЕНЬ)
		|		КОНЕЦ > 7
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	смартСтопЛистТехническойОтсрочки.Партнер,
		|	ИСТИНА
		|ИЗ
		|	РегистрСведений.смартСтопЛистТехническойОтсрочки КАК смартСтопЛистТехническойОтсрочки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.смартСтопЛистТехническойОтсрочки КАК смартСтопЛистТехническойОтсрочки1
		|		ПО смартСтопЛистТехническойОтсрочки.Партнер = смартСтопЛистТехническойОтсрочки1.Партнер
		|			И смартСтопЛистТехническойОтсрочки.Контрагент = смартСтопЛистТехническойОтсрочки1.Контрагент
		|			И смартСтопЛистТехническойОтсрочки.ЗаказКлиента = смартСтопЛистТехническойОтсрочки1.ЗаказКлиента
		|			И (НЕ смартСтопЛистТехническойОтсрочки1.ПродажаОтгрузкаЗапрещена)
		|ГДЕ
		|	смартСтопЛистТехническойОтсрочки.Партнер = &Партнер
		|	И смартСтопЛистТехническойОтсрочки.ПродажаОтгрузкаЗапрещена
		|
		|СГРУППИРОВАТЬ ПО
		|	смартСтопЛистТехническойОтсрочки.Партнер
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ смартСтопЛистТехническойОтсрочки.ЗаказКлиента) >= 3
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(МАКСИМУМ(смартСтопЛистТехническойОтсрочкиСрезПоследних.ПродажаОтгрузкаЗапрещена), ЛОЖЬ) КАК ПродажаОтгрузкаЗапрещена,
		|	ЕСТЬNULL(МАКСИМУМ(ВЫБОР
		|				КОГДА смартСтопЛистТехническойОтсрочкиСрезПоследних.ПродажаОтгрузкаЗапрещена
		|					ТОГДА смартСтопЛистТехническойОтсрочкиСрезПоследних.ЗаказКлиента.Дата
		|				ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			КОНЕЦ), ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаЗапрета,
		|	ЕСТЬNULL(МАКСИМУМ(ВТ_ПартнерыСНегативнойИсторией.ИмеетНегативнуюИсторию), ЛОЖЬ) КАК ИмеетНегативнуюИсторию
		|ИЗ
		|	РегистрСведений.смартСтопЛистТехническойОтсрочки.СрезПоследних(, Партнер = &Партнер) КАК смартСтопЛистТехническойОтсрочкиСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПартнерыСНегативнойИсторией КАК ВТ_ПартнерыСНегативнойИсторией
		|		ПО смартСтопЛистТехническойОтсрочкиСрезПоследних.Партнер = ВТ_ПартнерыСНегативнойИсторией.Партнер"; 
		Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(МАКСИМУМ(смартСтопЛистТехническойОтсрочкиСрезПоследних.ПродажаОтгрузкаЗапрещена), ЛОЖЬ) КАК ПродажаОтгрузкаЗапрещена,
		|	ЕСТЬNULL(МАКСИМУМ(ВЫБОР
		|			КОГДА смартСтопЛистТехническойОтсрочкиСрезПоследних.ПродажаОтгрузкаЗапрещена
		|				ТОГДА смартСтопЛистТехническойОтсрочкиСрезПоследних.ЗаказКлиента.Дата
		|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|		КОНЕЦ), ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаЗапрета
		|ИЗ
		|	РегистрСведений.смартСтопЛистТехническойОтсрочки.СрезПоследних(, Партнер = &Партнер) КАК смартСтопЛистТехническойОтсрочкиСрезПоследних";
	КонецЕсли;
	Запрос.УстановитьПараметр("Партнер", Партнер); 
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, ВыборкаДетальныеЗаписи);		
	КонецЕсли;
    Возврат Результат;
КонецФункции  

#КонецОбласти

#КонецЕсли
